package com.zavadski._1_Basics_of_software_code_development;

//2. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
public class task101 {
    public static void main(String[] args) {
        int a = 4;
        int b = 4;
        int c = 5;
        int z = ((a - 3) * b / 2) + c;
        System.out.println("z=" + z);
    }
}
